StreamAI/Nordic_nRF5_Project/examples/ble_central/ble_app_uart_c/main.c
    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_ADDR_FILTER, p_addr);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_ADDR_FILTER, false);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
}


/**@brief Function for handling characters received by the Nordic UART Service (NUS).
 *
 * @details This function takes a list of characters of length data_len and prints the characters out on UART.
 *          If @ref ECHOBACK_BLE_UART_DATA is set, the data is sent back to sender.
 */
static void ble_nus_chars_received_uart_print(uint8_t * p_data, uint16_t data_len)
{
    ret_code_t ret_val;

    NRF_LOG_DEBUG("Receiving data.");
    NRF_LOG_HEXDUMP_DEBUG(p_data, data_len);

    for (uint32_t i = 0; i < data_len; i++)
    {
        do
        {
            ret_val = app_uart_put(p_data[i]);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("app_uart_put failed for index 0x%04x.", i);
                APP_ERROR_CHECK(ret_val);
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
    if (p_data[data_len-1] == '\r')
    {
        while (app_uart_put('\n') == NRF_ERROR_BUSY);
    }
    if (ECHOBACK_BLE_UART_DATA)
    {
        // Send data back to the peripheral.
        do
        {
            ret_val = ble_nus_c_string_send(&m_ble_nus_c, p_data, data_len);
            if ((ret_val != NRF_SUCCESS) && (ret_val != NRF_ERROR_BUSY))
            {
                NRF_LOG_ERROR("Failed sending NUS message. Error 0x%x. ", ret_val);
                APP_ERROR_CHECK(ret_val);
            }
        } while (ret_val == NRF_ERROR_BUSY);
    }
}


/**@brief String convert to HEX. 
 */
static uint16_t StringToHex(char * str, uint8_t * out)
{
    char *p = str;
    uint8_t high = 0, low = 0;
    uint16_t tmplen = strlen(p), cnt = 0;

    while(cnt < (tmplen / 2))
    {
        high = ((*p >= 'a') && (*p <= 'f')) ? *p - 'a' + 10 : (((*p >= 'A') && (*p <= 'F')) ? *p - 'A' + 10 : *p - '0');
        p ++;
        low = ((*p >= 'a') && (*p <= 'f')) ? *p - 'a' + 10 : (((*p >= 'A') && (*p <= 'F')) ? *p - 'A' + 10 : *p - '0');
        out[cnt] = ((high & 0x0f) << 4 | (low & 0x0f));
        p ++;
        cnt ++;
    }

    if(tmplen % 2 != 0)
        out[cnt] = ((*p >= 'a') && (*p <= 'f')) ? *p - 'a' + 10 : (((*p >= 'A') && (*p <= 'F')) ? *p - 'A' + 10 : *p - '0');

    return tmplen / 2 + tmplen % 2;
}


/**@brief Process commands from UART. 
 */
static uint8_t uart_cmd_process(uint8_t * p_data, uint16_t * p_index)
{
    uint8_t i, temp_data[2*BLE_GAP_ADDR_LEN + 1];

    p_data[*p_index] = '\0';

    // Handle commands that connect to a specified target device.
    if(strlen(p_data) >= 17 && (strncmp(p_data, "CONN:", 5) == 0 || strncmp(p_data, "conn:", 5) == 0))
    {      
        // MSB(Most Significant Bit) convert to LSB(Least Significant Bit)
        for (i = 0; i < 2*BLE_GAP_ADDR_LEN; i++)
        {
            temp_data[i] = p_data[5 + 2*BLE_GAP_ADDR_LEN - 2 - i];
            i++;
            temp_data[i] = p_data[5 + 2*BLE_GAP_ADDR_LEN - i];
        }

        temp_data[i] = '\0';

        if(StringToHex((char *)temp_data, m_ble_addr) == BLE_GAP_ADDR_LEN)
        {
            *p_index = 0;
            scan_init(m_ble_addr);
            scan_start();
        }
    }

    // Handle commands to obtain RSSI information.
    if(strlen(p_data) >= 4 && (strncmp(p_data, "RSSI", 4) == 0 || strncmp(p_data, "rssi", 4) == 0))
    {
        *p_index = 0;
        printf("RSSI: %d dBm, Data Channel Index: %d.\r\n", m_ble_rssi.rssi, m_ble_rssi.ch_index);
    }

    // Handles the command to reset the device.
    if(strlen(p_data) >= 5 && (strncmp(p_data, "RESET", 5) == 0 || strncmp(p_data, "reset", 5) == 0))
    {
        *p_index = 0;
        // System reset.
        sd_nvic_SystemReset();
    }

    return *p_index;
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function receives a single character from the app_uart module and appends it to
 *          a string. The string is sent over BLE when the last character received is a
 *          'new line' '\n' (hex 0x0A) or if the string reaches the maximum data length.
 */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint16_t index = 0;
    uint32_t ret_val;

    switch (p_event->evt_type)
    {
        /**@snippet [Handling data from UART] */
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') ||
                (data_array[index - 1] == '\r') ||
                (index >= (m_ble_nus_max_data_len)))
            {
                // Process commands from UART.
                if(uart_cmd_process(data_array, &index) == 0)
                    break;
                
                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                NRF_LOG_HEXDUMP_DEBUG(data_array, index);

                do
                {
                    ret_val = ble_nus_c_string_send(&m_ble_nus_c, data_array, index);
                    if ( (ret_val != NRF_ERROR_INVALID_STATE) && (ret_val != NRF_ERROR_RESOURCES) )
                    {
                        APP_ERROR_CHECK(ret_val);
                    }
                } while (ret_val == NRF_ERROR_RESOURCES);

                index = 0;
            }
            break;

        /**@snippet [Handling data from UART] */
        case APP_UART_COMMUNICATION_ERROR:
            NRF_LOG_ERROR("Communication error occurred while handling UART.");
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            NRF_LOG_ERROR("Error occurred in FIFO module used by UART.");
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, ble_nus_c_evt_t const * p_ble_nus_evt)
{
    ret_code_t err_code;

    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG_INFO("Discovery complete.");
            err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
            APP_ERROR_CHECK(err_code);

            err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Connected to device with Nordic UART Service.");
            printf("Discovery service: Nordic UART Service.\r\n");
            break;

